{
  "_name_or_path": "/search/ai/pretrain_models/models--nghuyong--ernie-3.0-base-zh",
  "architectures": [
    "ErnieForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "finetuning_task": "task",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "SCAN_DOCUMENT",
    "1": "ID_PHOTOS",
    "2": "EXTRACT_TEXT",
    "3": "PDF_IMAGE",
    "4": "COMIC_FACE",
    "5": "GENERATE_PICTURE"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "SCAN_DOCUMENT": 0,
    "ID_PHOTOS": 1,
    "EXTRACT_TEXT": 2,
    "PDF_IMAGE": 3,
    "COMIC_FACE": 4,
    "GENERATE_PICTURE": 5
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 2048,
  "model_type": "ernie",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "task_type_vocab_size": 3,
  "torch_dtype": "float32",
  "transformers_version": "4.26.1",
  "type_vocab_size": 4,
  "use_cache": true,
  "use_task_id": true,
  "vocab_size": 40000
}
